Hybrid-Memcached-(with-aggre)/ex4_result/memtier_8t_16t_default_datasize_946_cycle_50_result
16        Threads
50        Connections per thread
120       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        39969.55          ---          ---        19.96850        19.32700        33.27900        40.70300     38564.37 
Gets           36.59        36.59         0.00        18.68059        18.68700        26.36700        39.16700        36.05 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      40006.14        36.59         0.00        19.96733        19.32700        33.27900        40.70300     38600.42 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.631        0.000
SET      16.639        5.000
SET      17.407       10.000
SET      17.791       15.000
SET      18.047       20.000
SET      18.303       25.000
SET      18.559       30.000
SET      18.815       35.000
SET      18.943       40.000
SET      19.199       45.000
SET      19.327       50.000
SET      19.455       52.500
SET      19.583       55.000
SET      19.711       57.500
SET      19.711       60.000
SET      19.839       62.500
SET      19.967       65.000
SET      20.095       67.500
SET      20.095       70.000
SET      20.223       72.500
SET      20.351       75.000
SET      20.479       76.250
SET      20.607       77.500
SET      20.607       78.750
SET      20.735       80.000
SET      20.863       81.250
SET      21.119       82.500
SET      21.375       83.750
SET      21.631       85.000
SET      21.887       86.250
SET      22.271       87.500
SET      22.527       88.125
SET      22.783       88.750
SET      23.039       89.375
SET      23.423       90.000
SET      23.679       90.625
SET      24.063       91.250
SET      24.447       91.875
SET      24.959       92.500
SET      25.599       93.125
SET      26.623       93.750
SET      27.135       94.062
SET      27.519       94.375
SET      27.775       94.688
SET      28.159       95.000
SET      28.415       95.312
SET      28.671       95.625
SET      29.055       95.938
SET      29.439       96.250
SET      29.823       96.562
SET      30.207       96.875
SET      30.463       97.031
SET      30.719       97.188
SET      30.975       97.344
SET      31.103       97.500
SET      31.359       97.656
SET      31.487       97.812
SET      31.743       97.969
SET      31.871       98.125
SET      31.999       98.281
SET      32.255       98.438
SET      32.255       98.516
SET      32.383       98.594
SET      32.511       98.672
SET      32.639       98.750
SET      32.767       98.828
SET      33.023       98.906
SET      33.279       98.984
SET      33.535       99.062
SET      33.791       99.141
SET      34.303       99.219
SET      34.559       99.258
SET      34.815       99.297
SET      34.815       99.336
SET      35.071       99.375
SET      35.327       99.414
SET      35.583       99.453
SET      35.583       99.492
SET      35.839       99.531
SET      36.095       99.570
SET      36.351       99.609
SET      36.607       99.629
SET      36.607       99.648
SET      36.863       99.668
SET      37.119       99.688
SET      37.375       99.707
SET      37.631       99.727
SET      37.887       99.746
SET      38.143       99.766
SET      38.399       99.785
SET      38.655       99.805
SET      38.911       99.814
SET      38.911       99.824
SET      39.167       99.834
SET      39.423       99.844
SET      39.423       99.854
SET      39.679       99.863
SET      39.935       99.873
SET      40.191       99.883
SET      40.447       99.893
SET      40.703       99.902
SET      40.959       99.907
SET      41.215       99.912
SET      41.727       99.917
SET      42.239       99.922
SET      42.751       99.927
SET      43.519       99.932
SET      44.287       99.937
SET      45.055       99.941
SET      45.567       99.946
SET      46.079       99.951
SET      46.847       99.954
SET      47.615       99.956
SET      48.895       99.958
SET      50.175       99.961
SET      51.455       99.963
SET      52.991       99.966
SET      55.039       99.968
SET      56.063       99.971
SET      57.087       99.973
SET      58.623       99.976
SET      59.391       99.977
SET      60.159       99.978
SET      60.927       99.979
SET      61.951       99.980
SET      62.975       99.982
SET      63.743       99.983
SET      64.511       99.984
SET      69.119       99.985
SET     134.143       99.987
SET     144.383       99.988
SET     147.455       99.988
SET     152.575       99.989
SET     307.199       99.990
SET     327.679       99.990
SET     348.159       99.991
SET     376.831       99.991
SET     407.551       99.992
SET     440.319       99.993
SET     477.183       99.993
SET     516.095       99.994
SET     536.575       99.994
SET     581.631       99.995
SET     602.111       99.995
SET     622.591       99.995
SET     647.167       99.995
SET     671.743       99.996
SET     692.223       99.996
SET     716.799       99.996
SET     749.567       99.997
SET     770.047       99.997
SET     782.335       99.997
SET     798.719       99.997
SET     811.007       99.997
SET     827.391       99.998
SET     839.679       99.998
SET     851.967       99.998
SET     868.351       99.998
SET     884.735       99.998
SET     892.927       99.998
SET     909.311       99.998
SET     917.503       99.999
SET     925.695       99.999
SET     933.887       99.999
SET     937.983       99.999
SET     950.271       99.999
SET     954.367       99.999
SET     966.655       99.999
SET     970.751       99.999
SET     974.847       99.999
SET     987.135       99.999
SET     987.135       99.999
SET     995.327       99.999
SET     999.423       99.999
SET    1007.615       99.999
SET    1007.615       99.999
SET    1011.711       99.999
SET    1015.807      100.000
SET    1019.903      100.000
SET    1019.903      100.000
SET    1019.903      100.000
[...]
SET    1023.999      100.000
SET    1028.095      100.000
SET    1028.095      100.000
SET    1028.095      100.000
[...]
SET    1032.191      100.000
SET    1032.191      100.000
SET    1036.287      100.000
SET    1036.287      100.000
SET    1036.287      100.000
[...]
SET    1040.383      100.000
SET    1040.383      100.000
SET    1040.383      100.000
[...]
SET    1044.479      100.000
SET    1044.479      100.000
---
GET       3.087        0.000
GET      15.679        5.000
GET      16.639       10.000
GET      17.023       15.000
GET      17.407       20.000
GET      17.663       25.000
GET      17.919       30.000
GET      18.047       35.000
GET      18.303       40.000
GET      18.431       45.000
GET      18.687       50.000
GET      18.687       52.500
GET      18.815       55.000
GET      18.943       57.500
GET      18.943       60.000
GET      19.071       62.500
GET      19.199       65.000
GET      19.327       67.500
GET      19.455       70.000
GET      19.583       72.500
GET      19.583       75.000
GET      19.711       76.250
GET      19.711       77.500
GET      19.839       78.750
GET      19.839       80.000
GET      19.967       81.250
GET      20.095       82.500
GET      20.095       83.750
GET      20.223       85.000
GET      20.351       86.250
GET      20.479       87.500
GET      20.607       88.125
GET      20.607       88.750
GET      20.735       89.375
GET      20.735       90.000
GET      20.991       90.625
GET      21.119       91.250
GET      21.247       91.875
GET      21.375       92.500
GET      21.631       93.125
GET      21.887       93.750
GET      22.015       94.062
GET      22.143       94.375
GET      22.271       94.688
GET      22.527       95.000
GET      22.655       95.312
GET      22.783       95.625
GET      23.039       95.938
GET      23.167       96.250
GET      23.423       96.562
GET      23.679       96.875
GET      23.679       97.031
GET      23.807       97.188
GET      23.935       97.344
GET      24.063       97.500
GET      24.191       97.656
GET      24.319       97.812
GET      24.319       97.969
GET      24.447       98.125
GET      24.703       98.281
GET      24.831       98.438
GET      24.959       98.516
GET      25.215       98.594
GET      25.343       98.672
GET      25.471       98.750
GET      25.727       98.828
GET      25.983       98.906
GET      26.367       98.984
GET      26.623       99.062
GET      27.007       99.141
GET      27.263       99.219
GET      27.391       99.258
GET      27.519       99.297
GET      27.519       99.336
GET      28.031       99.375
GET      28.927       99.414
GET      29.183       99.453
GET      31.487       99.492
GET      31.743       99.531
GET      32.511       99.570
GET      32.767       99.609
GET      33.279       99.629
GET      33.535       99.648
GET      36.095       99.668
GET      36.095       99.688
GET      36.351       99.707
GET      36.351       99.727
GET      37.375       99.746
GET      37.631       99.766
GET      37.631       99.785
GET      37.887       99.805
GET      37.887       99.814
GET      38.655       99.824
GET      38.655       99.834
GET      38.655       99.844
GET      38.655       99.854
GET      38.655       99.863
GET      38.655       99.873
GET      38.655       99.883
GET      39.167       99.893
GET      39.167       99.902
GET      39.167       99.907
GET      39.167       99.912
GET      39.167       99.917
GET      39.167       99.922
GET      39.167       99.927
GET      39.167       99.932
GET      39.935       99.937
GET      39.935       99.941
GET      39.935       99.946
GET      39.935       99.951
GET      39.935       99.954
GET      41.215       99.956
GET      41.215       99.958
GET      41.215       99.961
GET      41.215       99.963
GET      41.215       99.966
GET      41.215       99.968
GET      41.215       99.971
GET      41.215       99.973
GET      41.215       99.976
GET      41.215       99.977
GET      49.919       99.978
GET      49.919      100.000
---
WAIT      0.000      100.000